# -*- coding:utf-8 _*_
# config for year

# Citydata/Everyyear
YEAR = ((2010, u'2010年'),
            (2011, u'2011年'),
            (2012, u'2012年'),
            (2013, u'2013年'),
            (2014, u'2014年'),
            (2015, u'2015年'),
            (2016, u'2016年'),
            (2017, u'2017年'),
            (2018, u'2018年'),
            (2019, u'2019年'),
            (2020, u'2020年'),
            (2021, u'2021年'),
            (2022, u'2022年'),
            (2023, u'2023年'),
            (2024, u'2024年'),
            (2025, u'2025年'),
            (2026, u'2026年'),
            (2027, u'2027年'),
            (2028, u'2028年'),
            (2029, u'2029年'),
            (2030, u'2030年'),
            (2031, u'2031年'),
            (2032, u'2032年'),
            (2033, u'2033年'),
            (2034, u'2034年'),
            (2035, u'2035年'),
            (2036, u'2036年'),
            (2037, u'2037年'),
            (2038, u'2038年')
        )

# Project
CITY_LOCATE = (
        (0, u'成都'),
        (1, u'广州'),
        (2, u'上海'),
        (3, u'北京'),
        (4, u'深圳'),
        (5, u'天津'),
        (6, u'重庆'),
        (7, u'武汉'),
        (8, u'南京')
    )

PROJECT_STATUS = (
             (0, u'已创建'),
             (1, u'正在运行'),
             (2, u'中断'),
             (3, u'已经完成'),
    )

PROJECT_TYPE = (
        (0, u'会展评估'),
        (1, u'媒体评估'),
    )

SPIDER_SRC=(
            (1, u'专业会展网'),
            (2, u'互联网'),
            (0, u'其他'),
            )

# Report
REPORT_TYPE = (
        (0, u"会展报告8图"),
        (1, u'媒体报告6图'),
        (2, u'相同地区4图'),
        (3, u'不同地区4图'),
        (4, u'城市对比6图')
        )

# Siteproverty
NATURE = ((1, u"官网"),
              (2, u"会展专业类网"),
              (3, u"普通媒体类网"),
              (4, u"大型新闻网"))

FLAG = ((1, u'自动获得'),
            (2, u"待纠正"),
            (3, u"已确定"))

# Rule
USE = (
        (0, u'未启用'),
        (1, u'启用')
    )
